{
  "id": "01995d1e-68d0-7af1-81a4-695947696294",
  "status": "publish",
  "published": "2025-09-15T23:02:28+09:30",
  "modified": "2025-09-15T23:02:28+09:30",
  "slug": "hyundai-joins-the-7-year-warranty-club",
  "title": "Hyundai joins the 7-year warranty club",
  "description": "",
  "featuredMediaId": "01995d1e-68d4-786d-81d8-36710fc62a65",
  "categoryIds": [
    "01995d1e-68d5-74c8-9cfd-3f859e05a3c1",
    "01995d1e-68d5-7529-bc51-c2ff1793bfde"
  ],
  "tagIds": [
    "01995d1e-68d5-7788-8808-3ace9e2895c8",
    "01995d1e-68d6-7214-a919-ff297c16853b",
    "01995d1e-68d6-77eb-b01d-31c801f2b6a7",
    "01995d1e-68d6-75e2-a3d0-0e335b1b24d6",
    "01995d1e-68d5-7edf-ad6f-ce63a4e64809",
    "01995d1e-68d6-748b-a551-aa28fcdfabec",
    "01995d1e-68d6-74c4-8730-886528a55c14",
    "01995d1e-68d6-759f-b887-dd82b9da737a",
    "01995d1e-68d6-7a8e-9f36-33fd4e0678f8"
  ],
  "authorIds": [
    "01995d1e-68d5-7a13-8ee6-45029412faae"
  ],
  "content": "<p>THEY SWORE THEY WOULD never do it, but Hyundai has succumbed to the increasing pressure to equal its rivals’ seven-year warranty, partly, we suspect, as a result of being overtaken in Australian sales by its Korean rival Kia.</p>\n\n\n\n<p>Availability of this new seven-year unlimited kilometre warranty encompasses the entire Hyundai passenger vehicle portfolio, including SUV’s, and covering petrol, diesel, hybrid and EV powertrain models.&nbsp;</p>\n\n\n\n<p>Importantly for customers who have recently purchased a new Hyundai passenger vehicle, the warranty is backdated so that vehicles first registered from 1 June 2025 are eligible.&nbsp;</p>\n\n\n\n<p>To be eligible for the full seven year coverage, owners are required to have all scheduled services (from the first service onwards) completed by an authorised Hyundai dealer.&nbsp;</p>\n\n\n\n<p>“As the first automotive brand in Australia to offer a five-year unlimited kilometre warranty, we recognise the strategic importance of competitive warranty coverage,” said Hyundai Motor Company Australia Chief Executive Officer, Don Romano.&nbsp;</p>\n\n\n\n<p>“Over the past few months, we have worked closely with our National Dealer Council to develop a compelling and highly attractive warranty package that provides further peace of mind for our owners.”&nbsp;</p>\n\n\n\n<p><strong>Key Details</strong></p>\n\n\n\n<ul>\n<li>Applicable<strong>:</strong>&nbsp;all new Hyundai passenger vehicles first registered from 1 June 2025 are eligible (excluding STARIA LOAD and vehicles used for a “commercial application”, such as taxi, hire, ride-share)</li>\n\n\n\n<li>Service activated: the seven-year warranty is conditional on all scheduled services being completed at an authorised Hyundai dealer from the first service onwards</li>\n\n\n\n<li>In addition, each scheduled service must be carried out in accordance with the manufacturer’s recommended schedule at the specified servicing intervals for the duration of the seven-year ‘Extended New Car Warranty’.&nbsp;</li>\n\n\n\n<li>High-voltage battery retains eight-year/160,000 km (whichever occurs first) warranty</li>\n\n\n\n<li>The seven-year warranty covers key components such as corrosion, paint durability and multimedia system (which are sometimes excluded from competitor brand offerings)</li>\n\n\n\n<li>Where an eligible vehicle meets the necessary Hyundai dealer servicing conditions for the seven-year warranty, the complimentary Bluelink subscription is also extended to seven-years.</li>\n\n\n\n<li>24/7 Australia-wide Premium Roadside Support Plan available for the lifetime of the vehicle when customers continue to service within the Hyundai network</li>\n\n\n\n<li>Excludes: commercial vans (STARIA LOAD) which retain five-year/160,000km (whichever occurs first) warranty</li>\n\n\n\n<li>Excludes: vehicles used for “commercial applications”</li>\n\n\n\n<li>For customers who wish to service their vehicle outside of the Hyundai network, the “standard” five-year unlimited kilometre warranty still applies</li>\n</ul>"
}