{
  "id": "01995d1e-68d0-7538-b4b8-62a9aa052be1",
  "status": "publish",
  "published": "2025-09-10T06:18:20+09:30",
  "modified": "2025-09-10T06:18:20+09:30",
  "slug": "byd-sub-brand-yangwang-sets-ev-top-speed-record-in-germany",
  "title": "BYD sub-brand YangWang sets EV top speed record in Germany",
  "description": "",
  "featuredMediaId": "01995d1e-68d1-763c-88cc-e0d8b16cab48",
  "categoryIds": [
    "01995d1e-68d5-7fbc-923b-f0fbbc2d9304",
    "01995d1e-68d5-7529-bc51-c2ff1793bfde"
  ],
  "tagIds": [
    "01995d1e-68d5-7956-8e08-e1ae2069420e",
    "01995d1e-68d6-725d-b747-c6c870d17e95",
    "01995d1e-68d4-7689-b41d-6351fb749c46",
    "01995d1e-68d6-77eb-b01d-31c801f2b6a7",
    "01995d1e-68d6-75e2-a3d0-0e335b1b24d6",
    "01995d1e-68d5-7edf-ad6f-ce63a4e64809",
    "01995d1e-68d6-748b-a551-aa28fcdfabec",
    "01995d1e-68d6-74c4-8730-886528a55c14",
    "01995d1e-68d6-759f-b887-dd82b9da737a",
    "01995d1e-68d4-7a5f-bbc2-a36387f1f8f7",
    "01995d1e-68d4-7b74-adb2-be8c23a52743",
    "01995d1e-68d1-7227-a65a-c188454996fe",
    "01995d1e-68d4-7997-a548-fd033610645f",
    "01995d1e-68d4-7647-9a88-b0d7f26c8c98"
  ],
  "authorIds": [
    "01995d1e-68d5-7a13-8ee6-45029412faae"
  ],
  "content": "<p>WORLD RECORDS HAVE ALWAYS been a great way to promote new vehicles and brands, and EVs are no exception.</p>\n\n\n\n<p>BYD’s high-end sub-brand YangWang has set a new global electric vehicle (EV) top-speed record of 472.41 km/h at the ATP Automotive Testing Papenburg test track in Germany. The feat was achieved with YangWang’s latest U9 Track Edition supercar on 8 August 2025, making it the world’s fastest EV.</p>\n\n\n\n<p>The YangWang U9 Track Edition is built upon the same e<sup>4</sup>&nbsp;Platform and DiSus-X core technical architecture as the YangWang U9 currently on sale in China. On top of this, it features the world’s first mass-produced 1200V ultra-high-voltage vehicle platform, paired with a thermal-management system optimised for extreme conditions. This combination of an existing technical footprint and ground-breaking enhancements elevates the YangWang U9 Track Edition’s performance to unprecedented levels.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"576\" src=\"https://www.seniordriveraus.com/wp-content/uploads/2025/09/YANGWANG-U9-4-1024x576.jpg\" alt=\"\" class=\"wp-image-21446\" srcset=\"https://www.seniordriveraus.com/wp-content/uploads/2025/09/YANGWANG-U9-4-1024x576.jpg 1024w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/YANGWANG-U9-4-300x169.jpg 300w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/YANGWANG-U9-4-768x432.jpg 768w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/YANGWANG-U9-4.jpg 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /></figure>\n\n\n\n<p>Breaking world records demands both relentless power delivery and exceptional high-speed stability. The YangWang U9 Track Edition’s e<sup>4</sup>&nbsp;Platform — the world’s first quad-motor system to feature 30,000rpm high-performance motors — delivers peak power of 555kW per motor, it among the top tier in the global automotive industry. with a combined system output exceeding 2206.5kW. This grants the vehicle an astonishing power-to-weight ratio of 895kW per tonne.</p>\n\n\n\n<p>Beyond this, the e<sup>4</sup>&nbsp;Platform&#8217;s quad-motor independent torque-vectoring system continuously monitors road feedback, adjusting each wheel’s torque at an ultra-high frequency that exceeds 100 times per second. Even at high speeds, it maintains absolute control over body posture, ensuring no wheel slip or loss of traction.&nbsp;</p>\n\n\n\n<p>The DiSus-X Intelligent Body Control System performs rapid, independent vertical adjustments to the suspension at each corner of the vehicle during aggressive acceleration and cornering, or on uneven surfaces. This not only suppresses pitch and roll — enhancing driver comfort and confidence — but also actively optimises the contact patch between the tyres and the road, maximising grip. Working in synergy with the e<sup>4</sup>&nbsp;Platform, it delivers dual guarantees for vehicle stability and driving safety.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"586\" src=\"https://www.seniordriveraus.com/wp-content/uploads/2025/09/yangwang-u9-02-1024x586.jpg\" alt=\"\" class=\"wp-image-21449\" srcset=\"https://www.seniordriveraus.com/wp-content/uploads/2025/09/yangwang-u9-02-1024x586.jpg 1024w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/yangwang-u9-02-300x172.jpg 300w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/yangwang-u9-02-768x440.jpg 768w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/yangwang-u9-02.jpg 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /></figure>\n\n\n\n<p>Unlike traditional supercars, the YangWang U9 adopts the innovative “e<sup>4</sup>&nbsp;Platform + DiSus-X” technical architecture, introducing “body posture control” to racetrack scenarios and exploring the boundaries of safety and performance for supercars in track environments. Furthermore, the YangWang U9 Track Edition retains the aerodynamic design of the current YangWang U9 and is equipped with an enhanced, optional carbon-fibre front splitter that is already in mass production, fully verifying the scientific design and technical reliability of the YangWang U9 under ultra-high-speed operating conditions.</p>\n\n\n\n<p>To enhance tyre performance and durability under extreme driving conditions, YangWang, building on data gleaned during extensive testing and achievements in Germany in 2024, has engaged in a collaboration with Giti Tire to develop a track-focused semi-slick tyre. This high-performance tyre features optimised compound materials and a bespoke tread design, while an innovative knurling treatment at the wheel-rim interface, combined with high-viscosity lubricant, minimises relative slippage between the tyre and the rim during hard acceleration or braking. This reduces torque loss and tyre wear, while improving predictability and stability during dynamic manoeuvres.&nbsp;</p>\n\n\n\n<p>The record was set by German professional driver Marc Basseng, who was behind the wheel for the previous global EV speed record in 2024. After completing the high-speed test for YangWang, he said, “Last year, I thought I&#8217;d peaked. I never expected to break my own record so soon — but here we are, at the same track, with new technologies that have made it possible.”</p>\n\n\n\n<p>By setting a new global EV speed record, YangWang redefines the sustainable supercar. Backed by BYD&#8217;s innovation and sustainability commitments, YangWang employs cutting-edge tech to deliver unmatched performance, safety, and driving experience.</p>"
}