{
  "id": "01995d1e-68d0-7a0c-b25f-95675ebd54d3",
  "status": "publish",
  "published": "2025-09-15T23:04:04+09:30",
  "modified": "2025-09-15T23:04:04+09:30",
  "slug": "mg-introduces-driveaway-pricing-for-september",
  "title": "MG introduces driveaway pricing for September",
  "description": "",
  "featuredMediaId": "01995d1e-68d3-7df2-ad44-649b41bf184a",
  "categoryIds": [
    "01995d1e-68d5-74c8-9cfd-3f859e05a3c1"
  ],
  "tagIds": [
    "01995d1e-68d5-7ad5-a919-70f3c2de666c",
    "01995d1e-68d6-7162-a2bf-977658df59c8",
    "01995d1e-68d1-7bf6-89a2-e5deb25b390f",
    "01995d1e-68d1-7104-8529-1ca27d44c2ef",
    "01995d1e-68d4-7069-9c17-cf95df6950aa",
    "01995d1e-68d6-77eb-b01d-31c801f2b6a7",
    "01995d1e-68d6-75e2-a3d0-0e335b1b24d6",
    "01995d1e-68d5-7edf-ad6f-ce63a4e64809",
    "01995d1e-68d6-748b-a551-aa28fcdfabec",
    "01995d1e-68d6-74c4-8730-886528a55c14",
    "01995d1e-68d6-759f-b887-dd82b9da737a",
    "01995d1e-68d4-7790-b55b-d494043947b9"
  ],
  "authorIds": [
    "01995d1e-68d5-7a13-8ee6-45029412faae"
  ],
  "content": "<p>MG MOTOR AUSTRALIA HAS ANNOUNCED several limited offers for the month of September. The offers are across the brand’s portfolio of vehicles and include the introduction of drive-away pricing and cash back offers depending on model.&nbsp;</p>\n\n\n\n<p>Effective September 1, MG’s HS Excite is now priced from $35,990 drive away, with the upgraded HS Essence priced from $39,990 drive away. The introduction of driveaway pricing on the HS will see motorists save up to $4000 on the purchase price.&nbsp;</p>\n\n\n\n<p>Following the popularity of the previous $2000 cashback offer, the offer is now available in September on the ZS and MG3 range, including both the petrol and HYBRID+ models.</p>\n\n\n\n<p>Australian motorists will have the opportunity to enjoy the efficiency and power MG’s HYBRID+ platform delivers at an even more affordable price.&nbsp;</p>\n\n\n\n<p>MG Motor Australia’s Business Director, Kevin Gannon, commented, “We’ve had a great response to our cashback offer and we’re happy to have this fantastic offer across the ZS and MG3 ranges for September. MG will continue to provide leading value across our vehicles and this month’s offer should be secured quickly by interested buyers.&nbsp;</p>\n\n\n\n<p>“The MG HS offers an amazing opportunity for families who want that extra space in their daily vehicle. The value MG provides is industry leading and continues to offer Australian motorists more ways to drive away in their own new car.”&nbsp;</p>\n\n\n\n<p>The offer also includes $2000 cashback on ZST Vibe Demonstrator models until 30 September 2025.&nbsp;</p>\n\n\n\n<p>The HS, ZS and MG3 are backed by MG’s over 100-strong Australian dealership network and seven-year/unlimited kilometre warranty, unlocked to a 10-year/250,000 kilometre warranty when serviced at MG dealerships.</p>"
}