{
  "id": "01995d1e-68d0-7e67-8840-2183a90e6ac6",
  "status": "publish",
  "published": "2025-09-15T06:04:33+09:30",
  "modified": "2025-09-15T06:04:33+09:30",
  "slug": "zipping-around-zandvoort",
  "title": "Zipping Around Zandvoort",
  "description": "",
  "featuredMediaId": "01995d1e-68d1-716b-90ca-6bd9889b3424",
  "categoryIds": [
    "01995d1e-68d5-7529-bc51-c2ff1793bfde"
  ],
  "tagIds": [
    "01995d1e-68d4-7f95-97a0-ea3f7db8f622",
    "01995d1e-68d1-7366-82b7-8049e7533719",
    "01995d1e-68d6-7ba5-a107-3c767fe44589",
    "01995d1e-68d4-7c53-8ded-2683fcf0d755",
    "01995d1e-68d4-76e3-892e-a81bd13aba8f",
    "01995d1e-68d6-74ae-a7f3-6a84c81d4e8a",
    "01995d1e-68d6-7fab-ac47-ce8add59c143",
    "01995d1e-68d4-795a-aadc-d5d89db25061",
    "01995d1e-68d4-7409-bc44-66b6b4c81fce"
  ],
  "authorIds": [
    "01995d1e-68d6-7900-83b6-983c75809b2c"
  ],
  "content": "<p><strong>Circuit: </strong>Zandvoort, The Netherlands, 4.3km</p>\n\n\n\n<p><strong>Cars: </strong>McLaren 540C, Mercedes-AMG GT</p>\n\n\n\n<p><strong>Words</strong>: Barry Green</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"683\" src=\"https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-01-1024x683.jpg\" alt=\"\" class=\"wp-image-21522\" srcset=\"https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-01-1024x683.jpg 1024w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-01-300x200.jpg 300w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-01-768x512.jpg 768w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-01-1536x1024.jpg 1536w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-01-2048x1365.jpg 2048w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption class=\"wp-element-caption\">Porsche 911s line astern</figcaption></figure>\n\n\n\n<p>We’re at Zandvoort, home of the Formula 1 Heineken Dutch Grand Prix. There’s no Max Verstappen leading his home race in his Red Bull, urged on by hordes of orange-clad countrymen. Instead, it’s a drive experience day operated by Race Planet – and I’m up for it.</p>\n\n\n\n<p>But first, some background to our venue tucked away in the coastal sand dunes just outside Amsterdam. Zandvoort goes back a long way. Motor sport was planned here in 1938 only for a minor matter of World War 2 intervening the following year.</p>\n\n\n\n<p>After cessation of hostilities, racing kick-started with the Dutch Grand Prix in 1950. Two years later, Zandvoort hosted a round of the World Drivers Championship and, from 1958 until 1985 (except for 1972), it remained a fixture on the F1 calendar.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"683\" src=\"https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-03-1024x683.jpg\" alt=\"\" class=\"wp-image-21524\" srcset=\"https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-03-1024x683.jpg 1024w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-03-300x200.jpg 300w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-03-768x512.jpg 768w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-03-1536x1024.jpg 1536w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-03-2048x1365.jpg 2048w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption class=\"wp-element-caption\">Six decades on, Jack remains fondly remembered</figcaption></figure>\n\n\n\n<p>Like many circuits of similar vintage Zandvoort has had its share of fatalities (13, I make it), including F1 up-and-comers Piers Courage and Roger Williamson, F2 regulars Ian Raby and Chris Lambert and local luminary Rob Slotemaker.</p>\n\n\n\n<p>But, back to the future… &nbsp;I hop a train from Amsterdam Central to Zandvoort town. Then, with a chill wind whipping in off the North Sea and rain scuds threatening, make a 40-minute shuffle, hands in pockets, to the circuit.</p>\n\n\n\n<p>It’s a full day ahead. As well as circuit drives of a McLaren 540C, Mercedes-AMG GT, Porsche 911, BMW 1 Series track car and Formula RP1 open wheeler, there’s a mixed bag of activities.</p>\n\n\n\n<p>For my group, that includes hot laps in a Ford Mustang drift car, drag racing a Chrysler Charger SRT-8, a slalom and simulated ice driving (Suzuki Swift), slip course (Renault Clio), dune bashing (Suzuki Ignis) and karting.</p>\n\n\n\n<p>I’ll spare you the detail of the small fry except to say that the kart comp was a real hoot and nearly succeeded in lessening the misery of standing around in the bloody, freezing sleet.</p>\n\n\n\n<p>Fortunately, after lunch the weather ‘cleared’ comparatively and the track started to dry out slowly, just in time to bring out the quick stuff. And there’s nothing quicker I’ll be driving today than the 540C.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"683\" src=\"https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-04-1024x683.jpg\" alt=\"\" class=\"wp-image-21525\" srcset=\"https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-04-1024x683.jpg 1024w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-04-300x200.jpg 300w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-04-768x512.jpg 768w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-04-1536x1024.jpg 1536w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-04-2048x1365.jpg 2048w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption class=\"wp-element-caption\">McLarens heading out to play</figcaption></figure>\n\n\n\n<p>Clambering in through the open scissor doors immediately brings back sweet memories of the one and only McLaren I’d driven before, a 650S Spyder in the same glowing, isotype Napier Green, out of Las Vegas through Red Rock Canyon at sunset.</p>\n\n\n\n<p>Lowering into the 540C, I’m immediately reminded that McLaren well knows how to create a sporty driving environment. In a mid-engined supercar, you sit close to the centre, but every feature of the interior is slim and minimal, so you never feel cramped.</p>\n\n\n\n<p>Trundling out of pit lane onto the track proper just before the famous Tarzan Corner, I’m the meat in a Big Mac triple burger being paced by an instructor in a one of Race Planet’s ubiquitous 911 Carreras. Ahead lies 4.3km of smooth, flowing racetrack, an elevation change of 7.9m and 13 mostly right-handed corners.</p>\n\n\n\n<p>It’s unlikely we will be using all of the 3.8-litre, quad-cam V8’s 403kW (540bhp) of mumbo and 500Nm (369lb/ft) of grunt, but I still see no reason not to select ‘Track’ among the drive modes.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"682\" src=\"https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-08-1024x682.jpg\" alt=\"\" class=\"wp-image-21529\" srcset=\"https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-08-1024x682.jpg 1024w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-08-300x200.jpg 300w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-08-768x512.jpg 768w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-08-1536x1023.jpg 1536w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-08-2048x1364.jpg 2048w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption class=\"wp-element-caption\">BMW 1 Series track cars are a hoot to drive</figcaption></figure>\n\n\n\n<p>Tarzan – to give its native name – is Zandvoort’s most famous corner. Nicely stacked camber provides the wherewithal to pass around the outside as well as the conventional inside line. The story has it the corner was named after a local character by the same nickname who would only give up his vegetable garden in the dunes if the track&#8217;s designers named a nearby corner after him.</p>\n\n\n\n<p>Out of Tarzan, the track climbs on the way to Gerlach and continues gradually upwards to Hugenholz, the only part where guard rail is positioned right to the (outside) edge, then elevates further to the run through Hunzerug and Rob Slotemaker (more gradual curves than corners) dipping into the fast, sweeping Scheivlak.</p>\n\n\n\n<p>A short straight leads to Marlboro, before the track tightens into Renault and on to one of the few left-handers, Vodafone.</p>\n\n\n\n<p>It’s power down before out with the picks into the two-in-one (right-left) Audi S. Back on the gas towards Kumho and into the groove of the long, gradual right-handed curve that is Arie Luyendyk and onto the main straight.</p>\n\n\n\n<p>Row up the gears and in excess of 200km/h flashes up on the screen before hard on the anchors and paddle-shift down to 2<sup>nd</sup> for Tarzan. (Note: circuit layout and names are as before the upgrade to F1 spec in 2019-20).</p>\n\n\n\n<p>It’s a relatively safe place, modern-day Zandvoort, lined with grass verges either side of a wide racing surface, plenty of run-off and gravel catchment areas in the right places. We pick the pace up. Right foot goes down, revs soar, twin-turbo emits a whoosh and the 540C is in its element.</p>\n\n\n\n<p>With just 1311kg (dry) to lug, the Mac is light and lithe, adopting a flat stance on turn in, pivoting around its centre in that well-balanced way of nicely executed mid-engine design and construction. Just a single steering input is required, and the car holds its line precisely. Ditto braking – one firm, progressive application and velocity arrested.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"683\" src=\"https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-07-1024x683.jpg\" alt=\"\" class=\"wp-image-21528\" srcset=\"https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-07-1024x683.jpg 1024w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-07-300x200.jpg 300w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-07-768x512.jpg 768w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-07-1536x1024.jpg 1536w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-07-2048x1366.jpg 2048w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption class=\"wp-element-caption\">AMG GT gets the go-ahead</figcaption></figure>\n\n\n\n<p>Sometimes the letters GT are a little bit fanciful when stuck on a car’s rump, but not in the instance of the Mercedes-AMG. First impression upon jumping from the 540C, the Merc feels just that – a Grand Tourer – rather than track day car.</p>\n\n\n\n<p>The interior is more cabin than cockpit, you sit higher, see out clear as day and overall, the impression is of comfort rather than uncompromising competition focus.</p>\n\n\n\n<p>Hit the track, though, and the GT is far from out of place. With 600Nm on tap and 0-100km/h capability of 4.0-secs dead, the 4.0-litre bent-eight sweet-torques you.</p>\n\n\n\n<p>At just short of 1900kg (a whopping near-600kg more than the McLaren), there’s serious heft to haul yet it does so uncomplainingly. Moreover, that same weight seems to contribute to an overall solid, well-planted feel.</p>\n\n\n\n<p>On 19-inch wheels and having regular mechanical limited-slip diff instead of a fancy, electronically-controlled unit, slightly smaller front brakes and no ‘Race’ setting for its 7-speed, sequential auto, the GT might not have the full inventory of its more costly AMG S and R siblings, but it still gets the job done nicely around Zandvoort.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"576\" src=\"https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-09-1024x576.jpg\" alt=\"\" class=\"wp-image-21530\" srcset=\"https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-09-1024x576.jpg 1024w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-09-300x169.jpg 300w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-09-768x432.jpg 768w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-09-1536x864.jpg 1536w, https://www.seniordriveraus.com/wp-content/uploads/2025/09/Zandvoort-09.jpg 1920w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption class=\"wp-element-caption\">My turn at the wheel</figcaption></figure>\n\n\n\n<p>From road-going machinery, we transition to a pair of production cars set up for track use. First, the Porsche 911 which I took to be the Carrera 997 from 2006-07. Tractability and mechanical, rather than aero, grip is what these GT3 look-alikes are about.</p>\n\n\n\n<p>Although the 3.6-litre, flat-six delivers its peak power of 239kW high up the rev range (6800rpm), a flat torque curve (370Nm that tops out at 4250rpm) combined with well-matched, 5-speed sequential auto and diff ratios ensure that the sweet spot of performance is readily accessible.</p>\n\n\n\n<p>Not sure what suspension tweaks have been made, but the example I drove possessed plenty of tyre bite and traction at all times. Stripping the interior of anything superfluous has pared weight back to 1475kg and no doubt contributed to fleetness of foot; as did inserting a roll cage help enforce rigidity and polish vehicle dynamics.</p>\n\n\n\n<p>Eagerness fizzed through the Carrera as I negotiate Zandvoort’s 13 turns. And when the track straightens, a steady squeeze of the throttle has the Boxer coming out swinging, the distant Tarzanbocht fast looming up through the windscreen.</p>\n\n\n\n<p>Race Planet’s BMW 1 Cup Series cars might look pretty tame in comparison with the swoopy McLaren and winged 911, but these little jiggers gave their all out on track.</p>\n\n\n\n<p>Stripped out more spartanly than the Porsches and equipped with upgraded suspension, brakes, manual&nbsp;gearbox and a full roll cage, the rear-wheel-drive baby Beemers with the sum total of their 2.0-litre four-pot’s 105kW were all over the vastly more costly and powerful big names out on track.</p>\n\n\n\n<p>I had mine dancing from turn-in to apex to exit clipping point, potential oversteer peering over my shoulder, all the while wearing a watermelon-sliced grin and chuckling aloud.&nbsp;&nbsp;</p>\n\n\n\n<p>I’m still enthusing about it a couple of hours later, as I blow the froth off a tall, chilled Amstel and catch the last rays of the day canal-side in Amsterdam.</p>\n\n\n\n<p><strong>Car specs:</strong></p>\n\n\n\n<p><strong>McLaren 540C:</strong></p>\n\n\n\n<p>Basic price: €212,000 (about $375k Aust)</p>\n\n\n\n<p>Engine: 3.8-litre twin-turbo 32v V8</p>\n\n\n\n<p>Power: 403kW. Torque: 500Nm</p>\n\n\n\n<p>Transmission: 7-spd sequential dual-clutch auto</p>\n\n\n\n<p>Weight: 1311kg</p>\n\n\n\n<p>Drive: Rear-wheel</p>\n\n\n\n<p>0-100km/h: 3.5sec</p>\n\n\n\n<p><strong>Mercedes-AMG GT:</strong></p>\n\n\n\n<p>Basic price: €159 (about $270k Aust)</p>\n\n\n\n<p>Engine: 4.0-litre turbo DOHC 32v V8</p>\n\n\n\n<p>Power: 345kW</p>\n\n\n\n<p>Torque: 600Nm)</p>\n\n\n\n<p>Transmission: 7-spd sequential dual-clutch auto</p>\n\n\n\n<p>Weight: 1890kg</p>\n\n\n\n<p>Drive: Rear-wheel</p>\n\n\n\n<p>0-100km/h: 4.0-sec</p>\n\n\n\n<p><strong><em>Barry Green will be well-known to many of you and a welcome discovery for those of you who haven’t been reading his words for years.</em></strong></p>\n\n\n\n<p><strong><em>He has had an illustrious five-decade-long career writing for such titles as Racing Car News, Sports Car World as well as holding professional journalist roles with Australian Provincial Newspapers and News Limited and motoring writer and editor of the RACQ’s Road Ahead magazine. Along the way he found time to write and self-publish a trilogy of retro motor sport narratives – Driven to Succeed (the biography of Alec Mildren), Longford: Fast Track Back and Glory Days (the Albert Park story from 1953 to 1958).</em></strong></p>\n\n\n\n<p><strong><em>Now you can revel in his recollections of more than 80 drives of an eclectic mix of machinery on some of the world’s finest roads and racing circuits.</em></strong></p>"
}