{
  "id": "01995d1e-68d0-7128-b6db-3cd32ecd30bd",
  "status": "publish",
  "published": "2025-09-17T01:39:39+09:30",
  "modified": "2025-09-17T01:39:39+09:30",
  "slug": "a-mini-collaboration-but-theyre-not-for-sale",
  "title": "A MINI collaboration, but they’re not for sale",
  "description": "",
  "featuredMediaId": "01995d1e-68d1-76f6-8171-00ed6a192af8",
  "categoryIds": [
    "01995d1e-68d5-760b-84c5-ddee49d771be"
  ],
  "tagIds": [
    "01995d1e-68d4-75d8-add4-71717d745559",
    "01995d1e-68d5-72da-a1c2-d4ce33817ed7",
    "01995d1e-68d1-7ee6-9a20-ee34c9f30573",
    "01995d1e-68d4-7ae9-98f9-0422cd50404c",
    "01995d1e-68d4-7bb7-861f-d60f28d52154",
    "01995d1e-68d4-7c49-b6c0-ad2d43de3d54",
    "01995d1e-68d6-7875-8188-bbbee023b8a1",
    "01995d1e-68d4-7590-83e9-e8a6d3633599",
    "01995d1e-68d4-7748-9e2e-a36edfcb5b01"
  ],
  "authorIds": [
    "01995d1e-68d5-7a13-8ee6-45029412faae"
  ],
  "content": "<p>IN AN INTERESTING COLLABORATION, Mini John Cooper Works and Deus Ex Machina have created two customised one-off cars, rolling expressions of a lifestyle where a love of speed meets creativity and considered design. Built not just for performance, but for the people who live and breathe it. But they won’t be offered for sale!&nbsp;</p>\n\n\n\n<p>“MINI models have always been characterised by a blend of creative design and motorsport dynamics,” explains Stefan Richmann, Head of MINI. “Thanks to our collaboration with Deus Ex Machina, we are taking this philosophy to a new level and setting exciting new trends for fans and motorsport enthusiasts. The partners are united by their ‘passion for machines, innovation and creativity’ and an authentic relationship with their own community.”</p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"8640\" height=\"5760\" src=\"https://www.seniordriveraus.com/wp-content/uploads/2025/09/deus-ex-machina-limited-edition-02.jpg\" alt=\"\" class=\"wp-image-21500\"/></figure>\n\n\n\n<p><strong>Purist, functional and graphic design approach.</strong></p>\n\n\n\n<p>Both vehicle concepts are based on a MINI John Cooper Works model: the first, a MINI JCW Electric with up to 190kW, the second, a combustion engine-powered MINI JCW with 170kW. Each vehicle’s roof features a large white ‘X’, a connecting element, which signals a significant design and co-creation: the collaborative process between two iconic brands in their own right: MINI JCW x Deus.&nbsp;</p>\n\n\n\n<p>&#8220;In this extraordinary collaboration, we showcase two vehicles that remind us of motorsport history and successes of MINI,” says Holger Hampf, Head of MINI Design. “Every single detail has been crafted with artisanal precision and expertise. This has resulted in unique characters that are clearly perceived as belonging together through their distinctive design language and use of graphics.”&nbsp;</p>\n\n\n\n<p>Visible seams, striking switches and traditional levers emphasise the mechanical character of the cockpits. The materials and colours utilised throughout the vehicles create bold contrasts: a deliberate break with high gloss. Instead of perfection, authenticity is at the forefront: designers speak of a ‘raw, handcrafted approach’ that celebrates the ‘beauty of imperfection’. On the exterior, expressive graphics consisting of numbers, geometric elements and bright colours pay homage to MINI&#8217;s racing history.&nbsp;</p>\n\n\n\n<p><strong>The MINI JCW X Deus one-off cars.</strong></p>\n\n\n\n<p>Built as a pair &#8211; kindred in spirit, opposite in energy. One born of the coast: shaped by surfboards, sea spray, and the stripped-back rhythm of beach life. The other is forged on the track: lean, fast, and fuelled by a love of speed and precision.&nbsp;</p>\n\n\n\n<p><strong>The Skeg – sleek, electric, coast-bound.</strong></p>\n\n\n\n<p>The electric powered show car ‘The Skeg’ is a clean, minimal and quiet rebellion, drawing on materials, technologies and philosophies from the world of surfing: Fibreglass, acceleration and minimalism.&nbsp;</p>\n\n\n\n<p>The vehicle’s bodywork lands a bold first impression in a vivid yellow and silver finish &#8211; a nod to MINI’s progressive take on electric mobility. Wide fenders, an illuminated front grille, and a roof spoiler sharpen the silhouette, while semi-transparent fibreglass panels strip 15 per cent of the car’s weight and refine its aerodynamic performance.&nbsp;</p>\n\n\n\n<p>At the rear, the Flex Tip Surf Spoiler responds to airflow much like a surfboard rides the contours of a wave. Its form draws from the concave underside of a board, redirecting movement, generating lift, and turning design into function.&nbsp;</p>\n\n\n\n<p>Tension straps across the roof reference the familiar ritual of tying down a surfboard after a session, while remaining a characteristic design detail of the new MINI family, featured as an accent on the dashboard and in the 6 o&#8217;clock spoke of the steering wheel.&nbsp;</p>\n\n\n\n<p>Custom-made fibreglass elements on the roof, front, rear, and interior create a shifting play of light: translucent, strong, and responsive to time of day and environment, while the dashboard itself borrows directly from surfboard construction: lightweight, resilient, and visually distinctive.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"7754\" height=\"5169\" src=\"https://www.seniordriveraus.com/wp-content/uploads/2025/09/deus-ex-machina-limited-edition-03.jpg\" alt=\"\" class=\"wp-image-21501\"/></figure>\n\n\n\n<p><strong>The Interior.&nbsp;</strong></p>\n\n\n\n<p>Inside, the analogue controls are stripped back, simple, tactile, and true to purpose, reflecting a surf culture that prioritises purpose over polish.&nbsp;</p>\n\n\n\n<p>The car resembles a mobile surf shop. An example of the thoughtful functionality are the fibreglass trays for wetsuits. The specially shaped shelves provide a practical storage solution and bring the surf culture into the interior. The neoprene upholstery in the lightweight racing bucket seats – flexible, water-repellent, and comfortable – also creates a tactile connection to surfing. The fibreglass dashboard transfers the technology of surfboard construction into the automotive sector.&nbsp;</p>\n\n\n\n<p>The oversized ‘X’ returns as a visual anchor, while Deus Collection badges and 3D-printed details in the console serve as subtle signifiers of a shared culture &#8211; one grounded in craft, connection, and the pursuit of the ride.&nbsp;</p>\n\n\n\n<p><strong>The Machina. Loud, low, combustion-fed.</strong></p>\n\n\n\n<p>The Machina packs a compact punch of raw mechanics and motorsport bloodline. Inspired by the aesthetics of motorsport, it stands for pure racing enthusiasm and authentic functionality.&nbsp;</p>\n\n\n\n<p><strong>The exterior: signature elements with links to the racing scene.</strong></p>\n\n\n\n<p>The exterior design pays homage to the motorsport heritage of the MINI brand. Every characteristic feature has been carefully selected with a focus on functionality and emotional appeal.&nbsp;</p>\n\n\n\n<p>The red, white and black paintwork, complete with bold accents and Deus lettering on the rear, makes an immediate impression. Classic widened fenders nod to racing heritage, blending form and function, while four additional headlights mounted on the bonnet pay tribute to rally sport roots. Each custom-built light pod features subtle Deus branding, offering both performance and a distinctive visual signature.&nbsp;</p>\n\n\n\n<p>At the rear, the diffuser draws inspiration from the MINI JCW race car that tore through the legendary Nordschleife. Beyond its aggressive stance, it’s designed to optimise airflow and stability, with the centrally integrated exhaust serving as both a functional and aesthetic focal point, amplifying the engine’s sound and presence.&nbsp;</p>\n\n\n\n<p>Up front, a bespoke grille and perforated headlight surrounds enhance cooling performance, while the iconic MINI John Cooper Works light signature, complete with air intakes, anchors the car firmly in MINI’s high-performance lineage. Topping it off is a Can-Am-style rear spoiler: a bold piece of motorsport nostalgia that nods to an era when innovation in racing pushed both design and engineering to the edge.</p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"8640\" height=\"5760\" src=\"https://www.seniordriveraus.com/wp-content/uploads/2025/09/deus-ex-machina-limited-edition-04.jpg\" alt=\"\" class=\"wp-image-21502\"/></figure>\n\n\n\n<p><strong>The Interior.</strong></p>\n\n\n\n<p>Inside the JCW show car, the red, white and black palette holds strong – pared-back, purposeful, and unmistakably John Cooper Works. The five-point racing harnesses secure the driver, and ultimately become part of the driving experience, wrapping the body in precision.&nbsp;</p>\n\n\n\n<p>Raw aluminium floor plates offer more than grip, rather they echo the utilitarian aesthetic found in Deus’ custom motorcycle workshops from Sydney to Venice Beach to Canggu, grounding the car in a shared language of performance and craft.&nbsp;</p>\n\n\n\n<p>Weight-saving is built into every surface, from the stripped-back door panels marked with bold white ‘X’ motifs, to the waxed fabric dash &#8211; lightweight, durable, and finished with a lived-in patina that speaks to hands-on workmanship. Overhead, the exposed roll cage adds structure and statement in equal measure &#8211; a safety feature that nods to the car’s unfiltered racing DNA.&nbsp;</p>\n\n\n\n<p>The show car&#8217;s controls speak a clear language of functionality and directness. Every switch and every button is designed to function intuitively and reliably, even under extreme conditions. Toggle switches are classic elements – no complex menus, just direct, mechanical connections between thought and action. Each button has a clear function. A classic example, the hydraulic handbrake with its large lever, acting as a direct connection between driver and vehicle &#8211; a commitment to precision and control.</p>\n\n\n\n<p>The JCW show car is a driving manifesto and a tribute to the motorsport DNA of the MINI brand.&nbsp;</p>\n\n\n\n<p><strong>Concentrated creativity for two extraordinary designer pieces.</strong></p>\n\n\n\n<p>Alongside the MINI creative team, Deus’ Creative Director Carby Tuckwell and his wider creative cohort oversaw the striking exterior graphics of the two show cars, led by Matt Willey, complementing the work of Designworks. The outcome truly reflects extraordinary design dynamics and remarkable solutions across the two vehicles.&nbsp;</p>\n\n\n\n<p>“Deus has had a longstanding creative partnership with Matt &#8211; one powered by a true respect for the power of design and art,” said Carby Tuckwell, Deus Co-Founder &amp; Creative Director. “Having him involved in this project for us was a no-brainer &#8211; he worked closely with myself and the Deus team on our first creative project that was splashed across a MINI car in 2024.”&nbsp;</p>\n\n\n\n<p><strong>Deus x Matt Willey: The fascination of historic racing.</strong></p>\n\n\n\n<p>Deus’ Carby Tuckwell and Matt Willey have been working together since 2015. United by their fascination with classic motorsport liveries, they created a historic Mini Cooper S racing car in 2022 with a special paint finish designed by Willey. The design references the glorious and victorious history of the classic Mini at the Monte Carlo Rally, including the number 37, with which Paddy Hopkirk started in 1964 and achieved the British small car&#8217;s first overall victory in the most famous of all rallies.</p>\n\n\n\n<p>Matt Willey, a native of England who lives in Brooklyn, became a partner at the renowned design firm Pentagram after five years as art director of the New York Times Magazine.&nbsp;</p>\n\n\n\n<p><strong>A Shared Vision Becomes Fabric.</strong></p>\n\n\n\n<p>Woven into the partnership is a capsule MINI x Deus Ex Machina apparel collection, which will launch on September 8, 2025 at the IAA in Munich before becoming available globally via Deus Ex Machina’s e-commerce and retail network. Designed exclusively for the collaboration, the range draws on the shared DNA of both brands &#8211; precision engineering, timeless styling, and obsessive attention to detail.&nbsp;</p>\n\n\n\n<p>High-grade materials and thoughtful tailoring provide the benchmark for the range, with every garment reflecting Deus’ commitment to craftsmanship and its reputation for creating apparel that moves between lifestyle and legacy. With a deep understanding of storytelling through design, Deus brings authenticity and cultural relevance to the capsule, bridging the worlds of motorsport and modern apparel in a way that feels both current and enduring.&nbsp;</p>\n\n\n\n<p><strong>You can be first after me.</strong></p>\n\n\n\n<p>The highlight of the MINI JCW x Deus project&#8217;s communication campaign will be the world premiere at IAA Mobility 2025 in Munich, with the exclusive MINI JCW x Deus Night on 6 September at the MINI Pavilion.&nbsp;</p>\n\n\n\n<p>The MINI JCW x Deus collaboration will be on display at the MINI Pavilion until 14 September.&nbsp;</p>\n\n\n\n<p>The exclusive MINI x Deus lifestyle collection will be on sale in the pavilion, as well as online on all Deus channels and in their sales rooms <strong><em>(call us cyinics, but we suspect the merchandise may be the real reason behind the two cars)</em></strong>.</p>\n\n\n\n<p>‘You can be first after me’ is the motto that unites the worlds of MINI and Deus Ex Machina. Their shared history has begun and promises further exciting chapters in the name of automotive passion.</p>"
}